cases/floating/rotational_z/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	format		ascii;
	class		dictionary;
	object		fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	p
	{
		solver			GAMG;
		tolerance		1e-6;
		relTol			0.001;
		smoother		GaussSeidel;
		nPreSweeps		0;
		nPostSweeps		2;
		cacheAgglomeration	on;
		agglomerator		faceAreaPair;
		nCellsInCoarsestLevel	100;
		mergeLevels		1;
		minIter			2;
	}

	pFinal
	{
		solver			PCG;
		preconditioner		DIC;
		tolerance		1e-06;
		relTol			0;
		minIter			3;
	}

	U
	{
		solver			PBiCG;
		preconditioner		DILU;
		tolerance		1e-08;
		relTol			0;
		minIter			3;
	}

	UFinal
	{
		solver			PBiCG;
		preconditioner		DILU;
		tolerance		1e-08;
		relTol			0;
		minIter			3;
	}

	omega
	{
		solver			PBiCG;
		preconditioner		DILU;
		tolerance		1e-08;
		relTol			0;
		minIter			3;
	}

	omegaFinal
	{
		solver			PBiCG;
		preconditioner		DILU;
		tolerance		1e-08;
		relTol			0;
		minIter			3;
	}

	k
	{
		solver			PBiCG;
		preconditioner		DILU;
		tolerance		1e-08;
		relTol			0;
		minIter			3;
	}

	kFinal
	{
		solver			PBiCG;
		preconditioner		DILU;
		tolerance		1e-08;
		relTol			0;
		minIter			3;
	}
	
	yPsi
	{
		solver			PCG;
		preconditioner		DIC;
		tolerance		1e-06;
		relTol			0;
		minIter			2;
	}
}

PIMPLE
{
	nOuterCorrectors		2;
	nCorrectors			2;
	nNonOrthogonalCorrectors	1;
	momentumPredictor		yes;
	consitent			yes;
	pRefCell 			1001;
	pRefValue 			0; 
}

relaxationFactors
{
	fields
	{
		".*"	0.9;
	}
	
	equations
	{
		".*"	0.9;
	}
}
